namespace GenerateMedicalDocuments.AppData.DirectionToMSE.Helpers.MainHelpers
{
    /// <summary>
    /// Помощник валидных описаний.
    /// </summary>
    public static class ValidationCaptions
    {
        /// <summary>
        /// Описание "Гражданин по состоянию здоровья не может явиться в бюро (главное бюро, Федеральное бюро) медико-социальной экспертизы".
        /// </summary>
        public static string PersonNotComeToOffice = "Гражданин по состоянию здоровья не может явиться в бюро (главное бюро, Федеральное бюро) медико-социальной экспертизы";

        /// <summary>
        /// Описание "Нуждаемость в оказании паллиативной медицинской помощи".
        /// </summary>
        public static string PersonNeedsPaliativeHelp = "Нуждаемость в оказании паллиативной медицинской помощи";
        
        /// <summary>
        /// Описание "Нахождение на лечении в стационаре в связи с операцией по ампутации  (реампутации)  конечности (конечностей), нуждающийся в первичном протезировании".
        /// </summary>
        public static string PersonNeedsPrimaryProsthetics = "Нахождение на лечении в стационаре в связи с операцией по ампутации  (реампутации)  конечности (конечностей), нуждающийся в первичном протезировании";
    }
}